src/Reports/ИС_Ozon_РасчетПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ИС_Ozon_РасчетПотребности</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Reports/ИС_Ozon_РасчетПотребности/Forms/ФормаОтчета/Ext/Form/Module.bsl
//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры")
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаКлиенте
Процедура СформироватьТаблицуПотребностей(Команда)         
	Элементы.ТаблицаДляФормирования.Видимость = Истина;
	Элементы.ГруппаОтборДляСозадния.Видимость = Истина;
	СформироватьТаблицуПотребностейНаСервере();        	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаСервере
Процедура СформироватьТаблицуПотребностейНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ДокОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");  
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Для Каждого Строка Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Строка.ПредставлениеПользовательскойНастройки = "Профиль" Тогда
			Профиль = Строка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);	
	
	ТаблицаТест = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаТест);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);	
	
	ТаблицаДляФормирования.Очистить();
	
	Для Каждого Строка Из ТаблицаТест Цикл
		
		НСтр = ТаблицаДляФормирования.Добавить();
		НСтр.Использовать = Истина;
		НСтр.Номенклатура = Строка.Номенклатура;
		//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648		
		//НСтр.Характеристика = Строка.Характеристика;
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			НСтр.Характеристика = Строка.Характеристика;
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648
			
		Если ТаблицаТест.Колонки.Найти("СреднееПредполагаемое") <> Неопределено Тогда
			НСтр.СреднееПредполагаемое = Строка.СреднееПредполагаемое;
		КонецЕсли;
		
		Если ТаблицаТест.Колонки.Найти("ПростоеСкользящееКоличество") <> Неопределено Тогда
			НСтр.ПростоеСкользящееКоличество = Строка.ПростоеСкользящееКоличество;
		КонецЕсли;
		
		Если ТаблицаТест.Колонки.Найти("ЛинейноеВзвешенноеСкользящееКоличество") <> Неопределено Тогда
			НСтр.ЛинейноеВзвешенноеСкользящееКоличество = Строка.ЛинейноеВзвешенноеСкользящееКоличество;
		КонецЕсли;
				
	КонецЦикла;	
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаКлиенте
Процедура СоздатьДокументОтгрузки(Команда)   
	
	НеВыбраныПозиции = Истина;
	
	Для Каждого Строка Из ТаблицаДляФормирования Цикл
		Если Строка.Использовать Тогда
			НеВыбраныПозиции = Ложь;			
		КонецЕсли;
	КонецЦикла;
	
	Если НеВыбраныПозиции Тогда		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрано ни одной позиции для создания документа!");
		Возврат;
	КонецЕсли;     
	
	Комиссия25 = ИспользуетсяСхемаКомиссии25();
	
	Если Комиссия25 Тогда
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ПередачаТоваровХранителю.Форма.ФормаДокумента");	
	Иначе	
		ФормаНовогоДокумента = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
		//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
		ФормаНовогоДокумента.Элементы.ГруппаДоговор.Видимость = Истина;
		//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
	ФормаНовогоДокумента.Элементы.Договор.Доступность = Истина;
	//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
	
	ДанныеФормы = ФормаНовогоДокумента.Объект;
	
	ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25);
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
	Для Каждого Строка Из ДанныеФормы.Товары Цикл
		Строка.ХарактеристикиИспользуются = ЗначениеЗаполнено(Строка.Характеристика);
	КонецЦикла;
	//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);

    ФормаНовогоДокумента.Модифицированность = Истина;
	
    ФормаНовогоДокумента.Открыть();  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25)
		
	УстановитьПривилегированныйРежим(Истина); 
	
	ФукнциональныеОпции = ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	
	Если ФукнциональныеОпции.Количество() = 0 Тогда   
		ТекстСообщения = СтрШаблон(
			"Не заполнены настройки работы с маркетплейсом Ozon в настройках профиля для аккаунта: %1. Документ рту не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;        
	
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.ПартнерOzon; 
	Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	Контрагент = ФукнциональныеОпции.КонтрагентOzon;
	Договор = ФукнциональныеОпции.ДоговорOzon;
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках профиля для аккаунта: %1. Документ рту не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

		Если ЗначениеЗаполнено(Профиль.Договор) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Договор, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
				ХозОперация = Профиль.Договор.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Профиль.Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ХозОперация = Профиль.Соглашение.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Комиссия25 Тогда
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПередачаТоваровХранителю"));	
	Иначе	
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РеализацияТоваровУслуг"));	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Профиль.Организация);
	ДанныеЗаполнения.Вставить("Партнер", Профиль.Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", Профиль.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Профиль.Договор);
	ДанныеЗаполнения.Вставить("Соглашение", Профиль.Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Партнер 				= Профиль.Партнер;
	НовыйДокумент.Контрагент 			= Профиль.Контрагент;
	НовыйДокумент.Договор 	 			= Профиль.Договор;
	НовыйДокумент.Соглашение 			= Профиль.Соглашение; 
	
	Если Не Комиссия25 Тогда
		НовыйДокумент.ХозяйственнаяОперация = ХозОперация;
	КонецЕсли; 
	
	Товары = Новый ТаблицаЗначений;
	КвалификаторыЧисла = Новый КвалификаторыЧисла(13, 2, ДопустимыйЗнак.Неотрицательный);	
	
	Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Для Каждого Строка Из ТаблицаДляФормирования Цикл  
		
		Если Строка.СреднееПредполагаемое = 0 И Строка.ПростоеСкользящееКоличество = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Строка.Использовать Тогда
			НСтр = Товары.Добавить();
			НСтр.Номенклатура = Строка.Номенклатура;
			//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648		
			//НСтр.Характеристика = Строка.Характеристика;
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				НСтр.Характеристика = Строка.Характеристика;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648
						
			Если ТипЗначения = 0 Тогда
				НСтр.Количество = ?(Окр(Строка.СреднееПредполагаемое) > 0, Окр(Строка.СреднееПредполагаемое), 1);
			ИначеЕсли ТипЗначения = 1 Тогда
				НСтр.Количество = ?(Окр(Строка.ПростоеСкользящееКоличество) > 0, Окр(Строка.ПростоеСкользящееКоличество), 1)
			ИначеЕсли ТипЗначения = 2 Тогда 
				НСтр.Количество = ?(Окр(Строка.ЛинейноеВзвешенноеСкользящееКоличество) > 0, Окр(Строка.ЛинейноеВзвешенноеСкользящееКоличество), 1)
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЦикла;

	
	ТаблицаТранзакций = ПолучитьСписокТоваров(Товары);
	
	ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц"); 
	
	Если Не Комиссия25 Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
			НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
			ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
			НовыйДокумент.ЦенаВключаетНДС));
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаСервере
Функция ПолучитьСписокТоваров(Товары)
	
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25") Тогда
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены)";
		
	Иначе
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)";
	КонецЕсли;		
	
	Запрос = Новый Запрос(Текст);
	                                     
	Запрос.УстановитьПараметр("ВидЦены", Профиль.ВидЦены);
	Запрос.УстановитьПараметр("Товары", Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаСервере
Процедура ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций)
	
	НовыйДокумент.Товары.Очистить();
	НовыйДокумент.ВидыЗапасов.Очистить();  
	
	ВидЦены = Профиль.ВидЦены;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
			ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
			//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648		
			//ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;				
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648			
			ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
			ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
			ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
			ПараметрыКомплектующих.ЭтоТовар 			= Истина;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			Склады = Новый Массив;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", 		НовыйДокумент.Дата);
			ДополнительныеПараметры.Вставить("Валюта", 		НовыйДокумент.Валюта);
			ДополнительныеПараметры.Вставить("Склады", 		Склады);
			ДополнительныеПараметры.Вставить("Соглашение", 	НовыйДокумент.Соглашение);
			ДополнительныеПараметры.Вставить("Цена", 		Транзакция.Цена);
			ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.Цена);	
			ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены);
			//+ ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
			ДополнительныеПараметры.Вставить("Комиссия", 0);			
			//- ИнфоСофт Стояк Ю.К. 08.04.2025 УА #98475
			
			//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
			//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			
			Для Каждого стрКомплекта Из Комплектующие Цикл
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество + стрКомплекта.Погрешность;
				НоваяСтрока.Склад 					= Склад;
			КонецЦикла;						
		Иначе
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			//+ ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648		
			//НоваяСтрока.Характеристика 			= Транзакция.Характеристика;				
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				НоваяСтрока.Характеристика 		= Транзакция.Характеристика;
			КонецЕсли;
			//- ИнфоСофт Стояк Ю.К. 12.02.2025 УА #93648			
			НоваяСтрока.Количество			 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.Цена;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
			НоваяСтрока.ВидЦены 				= ВидЦены;
			НоваяСтрока.Склад 					= Склад;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653

//+ ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
&НаСервере
Функция ИспользуетсяСхемаКомиссии25()  
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");		
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если Не ЗначениеЗаполнено(Профиль.Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Договор.КомиссионныеПродажи25;	
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Профиль.Соглашение) Тогда
			Возврат Ложь;
		Иначе
			Возврат Профиль.Соглашение.КомиссионныеПродажи25;	
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции  //- ИнфоСофт Стояк Ю.К. 11.09.2024 УА #68653
